{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "pip install neo4j\n",
    "pip install neo4j-runway\n",
    "pip install langchain_google_genai\n",
    "pip install google-generativeai\n",
    "pip install pydantic\n",
    "pip install pydantic_core\n",
    "pip install langchain_core\n",
    "pip install -qU langchain-groq\n",
    "pip install langchain\n",
    "pip install graphviz\n",
    "pip install pydot\n",
    "pip install langchain_community"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "import numpy as np\n",
    "import pandas as pd\n",
    "import openai\n",
    "# from langchain import OpenAIDiscoveryLLM\n",
    "from IPython.display import display, Markdown, Image\n",
    "from neo4j_runway import Discovery, GraphDataModeler, PyIngest, UserInput, IngestionGenerator\n",
    "from neo4j_runway.code_generation import PyIngestConfigGenerator\n",
    "from neo4j_runway.llm.openai import OpenAIDiscoveryLLM, OpenAIDataModelingLLM"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "# load_dotenv()\n",
    "# OPENAI_API_KEY = os.getenv('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')\n",
    "# GOOGLE_API_KEY = 'AIzaSyCOixNIQyZUAo7n2QYhF36iRPPXgpgnPEw'\n",
    "# from langchain_google_genai import ChatGoogleGenerativeAI\n",
    "# llm = ChatGoogleGenerativeAI(model = \"gemini-pro\", google_api_key = GOOGLE_API_KEY)\n",
    "# NEO4J_URL = os.getenv('neo4j+s://your.databases.neo4j.io')\n",
    "# NEO4J_PASSWORD = os.getenv('StrongPassword123')\n",
    "# from langchain_groq import ChatGroq\n",
    "# GROQ_API_KEY=\"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\"\n",
    "# llm = ChatGroq(model_name = 'llama3-70b-8192',api_key = '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')\n",
    "NEO4J_URL = \"bolt://localhost:7687\"\n",
    "username = \"neo4j\"\n",
    "NEO4J_PASSWORD = \"StrongPassword123\"\n",
    "openai.api_key = os.getenv('sk-5tLuQzXGUemKeK54H-jdat1WZs7uFRvYDvWU83p-NZT3BlbkFJ2KPYOXc2YWLMW8bnv30KaxUYJQaAZx8jkPJ-tOMeoA')\n",
    "os.environ['OPENAI_API_KEY'] = 'sk-5tLuQzXGUemKeK54H-jdat1WZs7uFRvYDvWU83p-NZT3BlbkFJ2KPYOXc2YWLMW8bnv30KaxUYJQaAZx8jkPJ-tOMeoA'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "# llm.invoke(\"Hi\").content"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "disc_llm = OpenAIDiscoveryLLM()\n",
    "modeling_llm = OpenAIDataModelingLLM()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Disease</th>\n",
       "      <th>Fever</th>\n",
       "      <th>Cough</th>\n",
       "      <th>Fatigue</th>\n",
       "      <th>Difficulty Breathing</th>\n",
       "      <th>Age</th>\n",
       "      <th>Gender</th>\n",
       "      <th>Blood Pressure</th>\n",
       "      <th>Cholesterol Level</th>\n",
       "      <th>Outcome Variable</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Influenza</td>\n",
       "      <td>Yes</td>\n",
       "      <td>No</td>\n",
       "      <td>Yes</td>\n",
       "      <td>Yes</td>\n",
       "      <td>19</td>\n",
       "      <td>Female</td>\n",
       "      <td>Low</td>\n",
       "      <td>Normal</td>\n",
       "      <td>Positive</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Common Cold</td>\n",
       "      <td>No</td>\n",
       "      <td>Yes</td>\n",
       "      <td>Yes</td>\n",
       "      <td>No</td>\n",
       "      <td>25</td>\n",
       "      <td>Female</td>\n",
       "      <td>Normal</td>\n",
       "      <td>Normal</td>\n",
       "      <td>Negative</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Eczema</td>\n",
       "      <td>No</td>\n",
       "      <td>Yes</td>\n",
       "      <td>Yes</td>\n",
       "      <td>No</td>\n",
       "      <td>25</td>\n",
       "      <td>Female</td>\n",
       "      <td>Normal</td>\n",
       "      <td>Normal</td>\n",
       "      <td>Negative</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Asthma</td>\n",
       "      <td>Yes</td>\n",
       "      <td>Yes</td>\n",
       "      <td>No</td>\n",
       "      <td>Yes</td>\n",
       "      <td>25</td>\n",
       "      <td>Male</td>\n",
       "      <td>Normal</td>\n",
       "      <td>Normal</td>\n",
       "      <td>Positive</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Asthma</td>\n",
       "      <td>Yes</td>\n",
       "      <td>Yes</td>\n",
       "      <td>No</td>\n",
       "      <td>Yes</td>\n",
       "      <td>25</td>\n",
       "      <td>Male</td>\n",
       "      <td>Normal</td>\n",
       "      <td>Normal</td>\n",
       "      <td>Positive</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>344</th>\n",
       "      <td>Stroke</td>\n",
       "      <td>Yes</td>\n",
       "      <td>No</td>\n",
       "      <td>Yes</td>\n",
       "      <td>No</td>\n",
       "      <td>80</td>\n",
       "      <td>Female</td>\n",
       "      <td>High</td>\n",
       "      <td>High</td>\n",
       "      <td>Positive</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>345</th>\n",
       "      <td>Stroke</td>\n",
       "      <td>Yes</td>\n",
       "      <td>No</td>\n",
       "      <td>Yes</td>\n",
       "      <td>No</td>\n",
       "      <td>85</td>\n",
       "      <td>Male</td>\n",
       "      <td>High</td>\n",
       "      <td>High</td>\n",
       "      <td>Positive</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>346</th>\n",
       "      <td>Stroke</td>\n",
       "      <td>Yes</td>\n",
       "      <td>No</td>\n",
       "      <td>Yes</td>\n",
       "      <td>No</td>\n",
       "      <td>85</td>\n",
       "      <td>Male</td>\n",
       "      <td>High</td>\n",
       "      <td>High</td>\n",
       "      <td>Positive</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>347</th>\n",
       "      <td>Stroke</td>\n",
       "      <td>Yes</td>\n",
       "      <td>No</td>\n",
       "      <td>Yes</td>\n",
       "      <td>No</td>\n",
       "      <td>90</td>\n",
       "      <td>Female</td>\n",
       "      <td>High</td>\n",
       "      <td>High</td>\n",
       "      <td>Positive</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>348</th>\n",
       "      <td>Stroke</td>\n",
       "      <td>Yes</td>\n",
       "      <td>No</td>\n",
       "      <td>Yes</td>\n",
       "      <td>No</td>\n",
       "      <td>90</td>\n",
       "      <td>Female</td>\n",
       "      <td>High</td>\n",
       "      <td>High</td>\n",
       "      <td>Positive</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>349 rows × 10 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "         Disease Fever Cough Fatigue Difficulty Breathing  Age  Gender  \\\n",
       "0      Influenza   Yes    No     Yes                  Yes   19  Female   \n",
       "1    Common Cold    No   Yes     Yes                   No   25  Female   \n",
       "2         Eczema    No   Yes     Yes                   No   25  Female   \n",
       "3         Asthma   Yes   Yes      No                  Yes   25    Male   \n",
       "4         Asthma   Yes   Yes      No                  Yes   25    Male   \n",
       "..           ...   ...   ...     ...                  ...  ...     ...   \n",
       "344       Stroke   Yes    No     Yes                   No   80  Female   \n",
       "345       Stroke   Yes    No     Yes                   No   85    Male   \n",
       "346       Stroke   Yes    No     Yes                   No   85    Male   \n",
       "347       Stroke   Yes    No     Yes                   No   90  Female   \n",
       "348       Stroke   Yes    No     Yes                   No   90  Female   \n",
       "\n",
       "    Blood Pressure Cholesterol Level Outcome Variable  \n",
       "0              Low            Normal         Positive  \n",
       "1           Normal            Normal         Negative  \n",
       "2           Normal            Normal         Negative  \n",
       "3           Normal            Normal         Positive  \n",
       "4           Normal            Normal         Positive  \n",
       "..             ...               ...              ...  \n",
       "344           High              High         Positive  \n",
       "345           High              High         Positive  \n",
       "346           High              High         Positive  \n",
       "347           High              High         Positive  \n",
       "348           High              High         Positive  \n",
       "\n",
       "[349 rows x 10 columns]"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "disease_df = pd.read_csv('Disease_symptom_and_patient_profile_dataset.csv')\n",
    "disease_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Disease</th>\n",
       "      <th>Fever</th>\n",
       "      <th>Cough</th>\n",
       "      <th>Fatigue</th>\n",
       "      <th>Difficulty Breathing</th>\n",
       "      <th>Age</th>\n",
       "      <th>Gender</th>\n",
       "      <th>Blood Pressure</th>\n",
       "      <th>Cholesterol Level</th>\n",
       "      <th>Outcome Variable</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Influenza</td>\n",
       "      <td>Yes</td>\n",
       "      <td>No</td>\n",
       "      <td>Yes</td>\n",
       "      <td>Yes</td>\n",
       "      <td>19</td>\n",
       "      <td>Female</td>\n",
       "      <td>Low</td>\n",
       "      <td>Normal</td>\n",
       "      <td>Positive</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Asthma</td>\n",
       "      <td>Yes</td>\n",
       "      <td>Yes</td>\n",
       "      <td>No</td>\n",
       "      <td>Yes</td>\n",
       "      <td>25</td>\n",
       "      <td>Male</td>\n",
       "      <td>Normal</td>\n",
       "      <td>Normal</td>\n",
       "      <td>Positive</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Asthma</td>\n",
       "      <td>Yes</td>\n",
       "      <td>Yes</td>\n",
       "      <td>No</td>\n",
       "      <td>Yes</td>\n",
       "      <td>25</td>\n",
       "      <td>Male</td>\n",
       "      <td>Normal</td>\n",
       "      <td>Normal</td>\n",
       "      <td>Positive</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Influenza</td>\n",
       "      <td>Yes</td>\n",
       "      <td>Yes</td>\n",
       "      <td>Yes</td>\n",
       "      <td>Yes</td>\n",
       "      <td>25</td>\n",
       "      <td>Female</td>\n",
       "      <td>Normal</td>\n",
       "      <td>Normal</td>\n",
       "      <td>Positive</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Influenza</td>\n",
       "      <td>Yes</td>\n",
       "      <td>Yes</td>\n",
       "      <td>Yes</td>\n",
       "      <td>Yes</td>\n",
       "      <td>25</td>\n",
       "      <td>Female</td>\n",
       "      <td>Normal</td>\n",
       "      <td>Normal</td>\n",
       "      <td>Positive</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>314</th>\n",
       "      <td>Bronchitis</td>\n",
       "      <td>Yes</td>\n",
       "      <td>No</td>\n",
       "      <td>Yes</td>\n",
       "      <td>Yes</td>\n",
       "      <td>65</td>\n",
       "      <td>Male</td>\n",
       "      <td>High</td>\n",
       "      <td>High</td>\n",
       "      <td>Positive</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>315</th>\n",
       "      <td>Chronic Obstructive Pulmonary Disease (COPD)</td>\n",
       "      <td>Yes</td>\n",
       "      <td>No</td>\n",
       "      <td>Yes</td>\n",
       "      <td>Yes</td>\n",
       "      <td>65</td>\n",
       "      <td>Female</td>\n",
       "      <td>High</td>\n",
       "      <td>High</td>\n",
       "      <td>Positive</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>316</th>\n",
       "      <td>Chronic Obstructive Pulmonary Disease (COPD)</td>\n",
       "      <td>Yes</td>\n",
       "      <td>No</td>\n",
       "      <td>Yes</td>\n",
       "      <td>Yes</td>\n",
       "      <td>65</td>\n",
       "      <td>Female</td>\n",
       "      <td>High</td>\n",
       "      <td>High</td>\n",
       "      <td>Positive</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>330</th>\n",
       "      <td>Chronic Obstructive Pulmonary Disease (COPD)</td>\n",
       "      <td>No</td>\n",
       "      <td>Yes</td>\n",
       "      <td>Yes</td>\n",
       "      <td>Yes</td>\n",
       "      <td>70</td>\n",
       "      <td>Male</td>\n",
       "      <td>Normal</td>\n",
       "      <td>High</td>\n",
       "      <td>Negative</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>331</th>\n",
       "      <td>Chronic Obstructive Pulmonary Disease (COPD)</td>\n",
       "      <td>No</td>\n",
       "      <td>Yes</td>\n",
       "      <td>Yes</td>\n",
       "      <td>Yes</td>\n",
       "      <td>70</td>\n",
       "      <td>Male</td>\n",
       "      <td>Normal</td>\n",
       "      <td>High</td>\n",
       "      <td>Negative</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>88 rows × 10 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                          Disease Fever Cough Fatigue  \\\n",
       "0                                       Influenza   Yes    No     Yes   \n",
       "3                                          Asthma   Yes   Yes      No   \n",
       "4                                          Asthma   Yes   Yes      No   \n",
       "6                                       Influenza   Yes   Yes     Yes   \n",
       "7                                       Influenza   Yes   Yes     Yes   \n",
       "..                                            ...   ...   ...     ...   \n",
       "314                                    Bronchitis   Yes    No     Yes   \n",
       "315  Chronic Obstructive Pulmonary Disease (COPD)   Yes    No     Yes   \n",
       "316  Chronic Obstructive Pulmonary Disease (COPD)   Yes    No     Yes   \n",
       "330  Chronic Obstructive Pulmonary Disease (COPD)    No   Yes     Yes   \n",
       "331  Chronic Obstructive Pulmonary Disease (COPD)    No   Yes     Yes   \n",
       "\n",
       "    Difficulty Breathing  Age  Gender Blood Pressure Cholesterol Level  \\\n",
       "0                    Yes   19  Female            Low            Normal   \n",
       "3                    Yes   25    Male         Normal            Normal   \n",
       "4                    Yes   25    Male         Normal            Normal   \n",
       "6                    Yes   25  Female         Normal            Normal   \n",
       "7                    Yes   25  Female         Normal            Normal   \n",
       "..                   ...  ...     ...            ...               ...   \n",
       "314                  Yes   65    Male           High              High   \n",
       "315                  Yes   65  Female           High              High   \n",
       "316                  Yes   65  Female           High              High   \n",
       "330                  Yes   70    Male         Normal              High   \n",
       "331                  Yes   70    Male         Normal              High   \n",
       "\n",
       "    Outcome Variable  \n",
       "0           Positive  \n",
       "3           Positive  \n",
       "4           Positive  \n",
       "6           Positive  \n",
       "7           Positive  \n",
       "..               ...  \n",
       "314         Positive  \n",
       "315         Positive  \n",
       "316         Positive  \n",
       "330         Negative  \n",
       "331         Negative  \n",
       "\n",
       "[88 rows x 10 columns]"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "disease_df[disease_df['Difficulty Breathing']=='Yes']"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [],
   "source": [
    "disease_df.columns = disease_df.columns.str.strip()\n",
    "for i in disease_df.columns:\n",
    "    disease_df[i] = disease_df[i].astype(str)\n",
    "disease_df.to_csv('test_dis.csv', index=False)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [],
   "source": [
    "DATA_DESCRIPTION = {\n",
    "'Disease': 'The name of the disease or medical condition.',\n",
    "'Fever': 'Indicates whether the patient has a fever (Yes/No).',\n",
    "'Cough': 'Indicates whether the patient has a cough (Yes/No).',\n",
    "'Fatigue': 'Indicates whether the patient experiences fatigue (Yes/No).',\n",
    "'Difficulty Breathing': 'Indicates whether the patient has difficulty breathing (Yes/No).',\n",
    "'Age': 'The age of the patient in years.',\n",
    "'Gender': 'The gender of the patient (Male/Female).',\n",
    "'Blood Pressure': 'The blood pressure level of the patient (Normal/High).',\n",
    "'Cholesterol Level': 'The cholesterol level of the patient (Normal/High).',\n",
    "'Outcome Variable': 'The outcome variable indicating the result of the diagnosis or assessment for the specific disease (Positive/Negative).'\n",
    "}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/Users/navdeepsingh/Documents/Project/Knowledge_bot/genAi/lib/python3.12/site-packages/neo4j_runway/inputs/user_input.py:134: UserWarning: user_input should include key:value pair {general_description: ...} for best results.\n",
      "  warnings.warn(\n"
     ]
    },
    {
     "data": {
      "text/markdown": [
       "Based on the provided summary of the data, here is a preliminary analysis:\n",
       "\n",
       "### Overall Details:\n",
       "1. **Data Size and Completeness**:\n",
       "   - The dataset contains 349 entries and 10 columns.\n",
       "   - There are no missing values in the dataset, which is beneficial for analysis and modeling.\n",
       "\n",
       "2. **Data Types**:\n",
       "   - All columns are of type `object`, indicating that they are categorical or string data. This includes columns that might be better represented as numerical data (e.g., Age).\n",
       "\n",
       "3. **Unique Values and Distribution**:\n",
       "   - **Disease**: There are 116 unique diseases, with \"Asthma\" being the most frequent (23 occurrences).\n",
       "   - **Fever**: Binary feature with \"Yes\" being the most frequent (175 occurrences).\n",
       "   - **Cough**: Binary feature with \"No\" being the most frequent (182 occurrences).\n",
       "   - **Fatigue**: Binary feature with \"Yes\" being the most frequent (242 occurrences).\n",
       "   - **Difficulty Breathing**: Binary feature with \"No\" being the most frequent (261 occurrences).\n",
       "   - **Age**: 26 unique values, with \"45\" being the most frequent (42 occurrences).\n",
       "   - **Gender**: Binary feature with \"Female\" being the most frequent (176 occurrences).\n",
       "   - **Blood Pressure**: Three unique values, with \"High\" being the most frequent (167 occurrences).\n",
       "   - **Cholesterol Level**: Three unique values, with \"High\" being the most frequent (166 occurrences).\n",
       "   - **Outcome Variable**: Binary feature with \"Positive\" being the most frequent (186 occurrences).\n",
       "\n",
       "### Important Features:\n",
       "1. **Disease**:\n",
       "   - This is a key feature as it represents the medical condition being diagnosed or assessed. The high number of unique diseases (116) suggests a diverse dataset.\n",
       "\n",
       "2. **Symptoms (Fever, Cough, Fatigue, Difficulty Breathing)**:\n",
       "   - These binary features are crucial for understanding the presence of symptoms in patients. They can be used to identify patterns or correlations with specific diseases.\n",
       "\n",
       "3. **Demographics (Age, Gender)**:\n",
       "   - **Age**: Although currently an object type, it should be converted to a numerical type for better analysis. Age distribution can provide insights into the prevalence of diseases across different age groups.\n",
       "   - **Gender**: This binary feature can help in understanding gender-specific trends in diseases and symptoms.\n",
       "\n",
       "4. **Health Indicators (Blood Pressure, Cholesterol Level)**:\n",
       "   - These features provide important health metrics that can be correlated with diseases and outcomes. The presence of three unique values suggests there might be a third category (possibly \"Unknown\" or \"Borderline\") that needs further investigation.\n",
       "\n",
       "5. **Outcome Variable**:\n",
       "   - This is a critical feature as it indicates the result of the diagnosis or assessment. Understanding the distribution of positive and negative outcomes can help in evaluating the effectiveness of treatments or identifying high-risk conditions.\n",
       "\n",
       "### Additional Considerations:\n",
       "- **Data Cleaning**: Ensure that all categorical data is consistent (e.g., no typos or variations in spelling).\n",
       "- **Feature Engineering**: Consider creating new features or transforming existing ones (e.g., binning age into age groups).\n",
       "- **Statistical Analysis**: Perform statistical tests to identify significant relationships between features and the outcome variable.\n",
       "- **Visualization**: Use visualizations to explore the distribution of features and their relationships (e.g., histograms for age, bar charts for categorical features).\n",
       "\n",
       "This preliminary analysis provides a foundation for further exploration and modeling. The next steps would involve deeper statistical analysis, feature engineering, and visualization to uncover more insights and prepare the data for creating a graph data model."
      ],
      "text/plain": [
       "<IPython.core.display.Markdown object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "disc = Discovery(llm=disc_llm, user_input=DATA_DESCRIPTION, data=disease_df)\n",
    "disc.run()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "validation failed\n",
      "performing chain of thought process for error fix recommendations...\n",
      "recieved a valid response\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "DataModel(nodes=[Node(label='Disease', properties=[Property(name='name', type='str', csv_mapping='Disease', csv_mapping_other=None, is_unique=True, part_of_key=False)], csv_name=''), Node(label='Symptom', properties=[Property(name='fever', type='str', csv_mapping='Fever', csv_mapping_other=None, is_unique=False, part_of_key=False), Property(name='cough', type='str', csv_mapping='Cough', csv_mapping_other=None, is_unique=False, part_of_key=False), Property(name='fatigue', type='str', csv_mapping='Fatigue', csv_mapping_other=None, is_unique=False, part_of_key=False), Property(name='difficultyBreathing', type='str', csv_mapping='Difficulty Breathing', csv_mapping_other=None, is_unique=False, part_of_key=False)], csv_name=''), Node(label='Patient', properties=[Property(name='age', type='int', csv_mapping='Age', csv_mapping_other=None, is_unique=False, part_of_key=False), Property(name='gender', type='str', csv_mapping='Gender', csv_mapping_other=None, is_unique=True, part_of_key=False)], csv_name=''), Node(label='HealthIndicator', properties=[Property(name='bloodPressure', type='str', csv_mapping='Blood Pressure', csv_mapping_other=None, is_unique=False, part_of_key=False), Property(name='cholesterolLevel', type='str', csv_mapping='Cholesterol Level', csv_mapping_other=None, is_unique=False, part_of_key=False)], csv_name=''), Node(label='Outcome', properties=[Property(name='result', type='str', csv_mapping='Outcome Variable', csv_mapping_other=None, is_unique=False, part_of_key=False)], csv_name='')], relationships=[Relationship(type='HAS_SYMPTOM', properties=[], source='Disease', target='Symptom', csv_name=''), Relationship(type='HAS_HEALTH_INDICATOR', properties=[], source='Patient', target='HealthIndicator', csv_name=''), Relationship(type='HAS_OUTCOME', properties=[], source='Patient', target='Outcome', csv_name=''), Relationship(type='DIAGNOSED_WITH', properties=[], source='Patient', target='Disease', csv_name='')], metadata=None)"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "gdm = GraphDataModeler(llm=modeling_llm, discovery=disc)\n",
    "gdm.create_initial_model()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "image/svg+xml": [
       "<?xml version=\"1.0\" encoding=\"UTF-8\" standalone=\"no\"?>\n",
       "<!DOCTYPE svg PUBLIC \"-//W3C//DTD SVG 1.1//EN\"\n",
       " \"http://www.w3.org/Graphics/SVG/1.1/DTD/svg11.dtd\">\n",
       "<!-- Generated by graphviz version 12.1.0 (20240811.2233)\n",
       " -->\n",
       "<!-- Pages: 1 -->\n",
       "<svg width=\"829pt\" height=\"542pt\"\n",
       " viewBox=\"0.00 0.00 829.06 541.51\" xmlns=\"http://www.w3.org/2000/svg\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">\n",
       "<g id=\"graph0\" class=\"graph\" transform=\"scale(1 1) rotate(0) translate(4 537.51)\">\n",
       "<polygon fill=\"white\" stroke=\"none\" points=\"-4,4 -4,-537.51 825.06,-537.51 825.06,4 -4,4\"/>\n",
       "<!-- Disease -->\n",
       "<g id=\"node1\" class=\"node\">\n",
       "<title>Disease</title>\n",
       "<ellipse fill=\"none\" stroke=\"black\" cx=\"167.76\" cy=\"-290.09\" rx=\"105.71\" ry=\"51.97\"/>\n",
       "<text text-anchor=\"middle\" x=\"167.76\" y=\"-309.54\" font-family=\"Times,serif\" font-size=\"14.00\">Disease</text>\n",
       "<text text-anchor=\"middle\" x=\"167.76\" y=\"-277.04\" font-family=\"Times,serif\" font-size=\"14.00\">properties:</text>\n",
       "<text text-anchor=\"middle\" x=\"167.76\" y=\"-260.54\" font-family=\"Times,serif\" font-size=\"14.00\">name: Disease *unique*</text>\n",
       "</g>\n",
       "<!-- Symptom -->\n",
       "<g id=\"node2\" class=\"node\">\n",
       "<title>Symptom</title>\n",
       "<ellipse fill=\"none\" stroke=\"black\" cx=\"167.76\" cy=\"-86.97\" rx=\"167.76\" ry=\"86.97\"/>\n",
       "<text text-anchor=\"middle\" x=\"167.76\" y=\"-131.17\" font-family=\"Times,serif\" font-size=\"14.00\">Symptom</text>\n",
       "<text text-anchor=\"middle\" x=\"167.76\" y=\"-98.67\" font-family=\"Times,serif\" font-size=\"14.00\">properties:</text>\n",
       "<text text-anchor=\"middle\" x=\"167.76\" y=\"-82.17\" font-family=\"Times,serif\" font-size=\"14.00\">fever: Fever</text>\n",
       "<text text-anchor=\"middle\" x=\"167.76\" y=\"-65.67\" font-family=\"Times,serif\" font-size=\"14.00\">cough: Cough</text>\n",
       "<text text-anchor=\"middle\" x=\"167.76\" y=\"-49.17\" font-family=\"Times,serif\" font-size=\"14.00\">fatigue: Fatigue</text>\n",
       "<text text-anchor=\"middle\" x=\"167.76\" y=\"-32.67\" font-family=\"Times,serif\" font-size=\"14.00\">difficultyBreathing: Difficulty Breathing</text>\n",
       "</g>\n",
       "<!-- Disease&#45;&gt;Symptom -->\n",
       "<g id=\"edge1\" class=\"edge\">\n",
       "<title>Disease&#45;&gt;Symptom</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M167.76,-237.82C167.76,-221.9 167.76,-203.78 167.76,-185.79\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"171.26,-185.82 167.76,-175.82 164.26,-185.82 171.26,-185.82\"/>\n",
       "<text text-anchor=\"middle\" x=\"218.76\" y=\"-195.15\" font-family=\"Times,serif\" font-size=\"14.00\">HAS_SYMPTOM</text>\n",
       "</g>\n",
       "<!-- Patient -->\n",
       "<g id=\"node3\" class=\"node\">\n",
       "<title>Patient</title>\n",
       "<ellipse fill=\"none\" stroke=\"black\" cx=\"439.76\" cy=\"-469.87\" rx=\"108.89\" ry=\"63.64\"/>\n",
       "<text text-anchor=\"middle\" x=\"439.76\" y=\"-497.57\" font-family=\"Times,serif\" font-size=\"14.00\">Patient</text>\n",
       "<text text-anchor=\"middle\" x=\"439.76\" y=\"-465.07\" font-family=\"Times,serif\" font-size=\"14.00\">properties:</text>\n",
       "<text text-anchor=\"middle\" x=\"439.76\" y=\"-448.57\" font-family=\"Times,serif\" font-size=\"14.00\">age: Age</text>\n",
       "<text text-anchor=\"middle\" x=\"439.76\" y=\"-432.07\" font-family=\"Times,serif\" font-size=\"14.00\">gender: Gender *unique*</text>\n",
       "</g>\n",
       "<!-- Patient&#45;&gt;Disease -->\n",
       "<g id=\"edge4\" class=\"edge\">\n",
       "<title>Patient&#45;&gt;Disease</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M366.98,-422.35C349.67,-411.22 331.29,-399.34 314.26,-388.23 289.67,-372.18 262.87,-354.47 238.99,-338.61\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"241.17,-335.86 230.91,-333.24 237.3,-341.69 241.17,-335.86\"/>\n",
       "<text text-anchor=\"middle\" x=\"375.01\" y=\"-374.93\" font-family=\"Times,serif\" font-size=\"14.00\">DIAGNOSED_WITH</text>\n",
       "</g>\n",
       "<!-- HealthIndicator -->\n",
       "<g id=\"node4\" class=\"node\">\n",
       "<title>HealthIndicator</title>\n",
       "<ellipse fill=\"none\" stroke=\"black\" cx=\"439.76\" cy=\"-290.09\" rx=\"148.67\" ry=\"63.64\"/>\n",
       "<text text-anchor=\"middle\" x=\"439.76\" y=\"-317.79\" font-family=\"Times,serif\" font-size=\"14.00\">HealthIndicator</text>\n",
       "<text text-anchor=\"middle\" x=\"439.76\" y=\"-285.29\" font-family=\"Times,serif\" font-size=\"14.00\">properties:</text>\n",
       "<text text-anchor=\"middle\" x=\"439.76\" y=\"-268.79\" font-family=\"Times,serif\" font-size=\"14.00\">bloodPressure: Blood Pressure</text>\n",
       "<text text-anchor=\"middle\" x=\"439.76\" y=\"-252.29\" font-family=\"Times,serif\" font-size=\"14.00\">cholesterolLevel: Cholesterol Level</text>\n",
       "</g>\n",
       "<!-- Patient&#45;&gt;HealthIndicator -->\n",
       "<g id=\"edge2\" class=\"edge\">\n",
       "<title>Patient&#45;&gt;HealthIndicator</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M439.76,-405.94C439.76,-392.75 439.76,-378.73 439.76,-365.18\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"443.26,-365.45 439.76,-355.45 436.26,-365.45 443.26,-365.45\"/>\n",
       "<text text-anchor=\"middle\" x=\"523.39\" y=\"-374.93\" font-family=\"Times,serif\" font-size=\"14.00\">HAS_HEALTH_INDICATOR</text>\n",
       "</g>\n",
       "<!-- Outcome -->\n",
       "<g id=\"node5\" class=\"node\">\n",
       "<title>Outcome</title>\n",
       "<ellipse fill=\"none\" stroke=\"black\" cx=\"713.76\" cy=\"-290.09\" rx=\"107.3\" ry=\"51.97\"/>\n",
       "<text text-anchor=\"middle\" x=\"713.76\" y=\"-309.54\" font-family=\"Times,serif\" font-size=\"14.00\">Outcome</text>\n",
       "<text text-anchor=\"middle\" x=\"713.76\" y=\"-277.04\" font-family=\"Times,serif\" font-size=\"14.00\">properties:</text>\n",
       "<text text-anchor=\"middle\" x=\"713.76\" y=\"-260.54\" font-family=\"Times,serif\" font-size=\"14.00\">result: Outcome Variable</text>\n",
       "</g>\n",
       "<!-- Patient&#45;&gt;Outcome -->\n",
       "<g id=\"edge3\" class=\"edge\">\n",
       "<title>Patient&#45;&gt;Outcome</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M529.22,-433.13C556.39,-420.6 585.68,-405.33 610.76,-388.23 628.75,-375.96 646.62,-360.56 662.3,-345.66\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"664.44,-348.45 669.2,-338.98 659.58,-343.42 664.44,-348.45\"/>\n",
       "<text text-anchor=\"middle\" x=\"683.03\" y=\"-374.93\" font-family=\"Times,serif\" font-size=\"14.00\">HAS_OUTCOME</text>\n",
       "</g>\n",
       "</g>\n",
       "</svg>\n"
      ],
      "text/plain": [
       "<graphviz.graphs.Digraph at 0x12f10a030>"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "gdm.current_model.visualize()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "recieved a valid response\n"
     ]
    },
    {
     "data": {
      "image/svg+xml": [
       "<?xml version=\"1.0\" encoding=\"UTF-8\" standalone=\"no\"?>\n",
       "<!DOCTYPE svg PUBLIC \"-//W3C//DTD SVG 1.1//EN\"\n",
       " \"http://www.w3.org/Graphics/SVG/1.1/DTD/svg11.dtd\">\n",
       "<!-- Generated by graphviz version 12.1.0 (20240811.2233)\n",
       " -->\n",
       "<!-- Pages: 1 -->\n",
       "<svg width=\"1050pt\" height=\"338pt\"\n",
       " viewBox=\"0.00 0.00 1050.06 338.39\" xmlns=\"http://www.w3.org/2000/svg\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">\n",
       "<g id=\"graph0\" class=\"graph\" transform=\"scale(1 1) rotate(0) translate(4 334.39)\">\n",
       "<polygon fill=\"white\" stroke=\"none\" points=\"-4,4 -4,-334.39 1046.06,-334.39 1046.06,4 -4,4\"/>\n",
       "<!-- Disease -->\n",
       "<g id=\"node1\" class=\"node\">\n",
       "<title>Disease</title>\n",
       "<ellipse fill=\"none\" stroke=\"black\" cx=\"541.76\" cy=\"-278.42\" rx=\"105.71\" ry=\"51.97\"/>\n",
       "<text text-anchor=\"middle\" x=\"541.76\" y=\"-297.87\" font-family=\"Times,serif\" font-size=\"14.00\">Disease</text>\n",
       "<text text-anchor=\"middle\" x=\"541.76\" y=\"-265.37\" font-family=\"Times,serif\" font-size=\"14.00\">properties:</text>\n",
       "<text text-anchor=\"middle\" x=\"541.76\" y=\"-248.87\" font-family=\"Times,serif\" font-size=\"14.00\">name: Disease *unique*</text>\n",
       "</g>\n",
       "<!-- Symptom -->\n",
       "<g id=\"node2\" class=\"node\">\n",
       "<title>Symptom</title>\n",
       "<ellipse fill=\"none\" stroke=\"black\" cx=\"167.76\" cy=\"-86.97\" rx=\"167.76\" ry=\"86.97\"/>\n",
       "<text text-anchor=\"middle\" x=\"167.76\" y=\"-131.17\" font-family=\"Times,serif\" font-size=\"14.00\">Symptom</text>\n",
       "<text text-anchor=\"middle\" x=\"167.76\" y=\"-98.67\" font-family=\"Times,serif\" font-size=\"14.00\">properties:</text>\n",
       "<text text-anchor=\"middle\" x=\"167.76\" y=\"-82.17\" font-family=\"Times,serif\" font-size=\"14.00\">fever: Fever</text>\n",
       "<text text-anchor=\"middle\" x=\"167.76\" y=\"-65.67\" font-family=\"Times,serif\" font-size=\"14.00\">cough: Cough</text>\n",
       "<text text-anchor=\"middle\" x=\"167.76\" y=\"-49.17\" font-family=\"Times,serif\" font-size=\"14.00\">fatigue: Fatigue</text>\n",
       "<text text-anchor=\"middle\" x=\"167.76\" y=\"-32.67\" font-family=\"Times,serif\" font-size=\"14.00\">difficultyBreathing: Difficulty Breathing</text>\n",
       "</g>\n",
       "<!-- Disease&#45;&gt;Symptom -->\n",
       "<g id=\"edge2\" class=\"edge\">\n",
       "<title>Disease&#45;&gt;Symptom</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M460.84,-244.5C435.28,-233.59 407.11,-221 381.76,-208.45 350.82,-193.12 318.04,-175.44 287.68,-158.42\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"289.66,-155.52 279.23,-153.66 286.23,-161.62 289.66,-155.52\"/>\n",
       "<text text-anchor=\"middle\" x=\"432.76\" y=\"-195.15\" font-family=\"Times,serif\" font-size=\"14.00\">HAS_SYMPTOM</text>\n",
       "</g>\n",
       "<!-- Demographics -->\n",
       "<g id=\"node3\" class=\"node\">\n",
       "<title>Demographics</title>\n",
       "<ellipse fill=\"none\" stroke=\"black\" cx=\"423.76\" cy=\"-86.97\" rx=\"70.71\" ry=\"63.64\"/>\n",
       "<text text-anchor=\"middle\" x=\"423.76\" y=\"-114.67\" font-family=\"Times,serif\" font-size=\"14.00\">Demographics</text>\n",
       "<text text-anchor=\"middle\" x=\"423.76\" y=\"-82.17\" font-family=\"Times,serif\" font-size=\"14.00\">properties:</text>\n",
       "<text text-anchor=\"middle\" x=\"423.76\" y=\"-65.67\" font-family=\"Times,serif\" font-size=\"14.00\">age: Age</text>\n",
       "<text text-anchor=\"middle\" x=\"423.76\" y=\"-49.17\" font-family=\"Times,serif\" font-size=\"14.00\">gender: Gender</text>\n",
       "</g>\n",
       "<!-- Disease&#45;&gt;Demographics -->\n",
       "<g id=\"edge1\" class=\"edge\">\n",
       "<title>Disease&#45;&gt;Demographics</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M510.41,-228.5C506.14,-221.78 501.83,-214.95 497.76,-208.45 486.55,-190.54 474.52,-171.06 463.48,-153.08\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"466.46,-151.26 458.25,-144.56 460.49,-154.92 466.46,-151.26\"/>\n",
       "<text text-anchor=\"middle\" x=\"568.26\" y=\"-195.15\" font-family=\"Times,serif\" font-size=\"14.00\">HAS_DEMOGRAPHICS</text>\n",
       "</g>\n",
       "<!-- HealthIndicator -->\n",
       "<g id=\"node4\" class=\"node\">\n",
       "<title>HealthIndicator</title>\n",
       "<ellipse fill=\"none\" stroke=\"black\" cx=\"660.76\" cy=\"-86.97\" rx=\"148.67\" ry=\"63.64\"/>\n",
       "<text text-anchor=\"middle\" x=\"660.76\" y=\"-114.67\" font-family=\"Times,serif\" font-size=\"14.00\">HealthIndicator</text>\n",
       "<text text-anchor=\"middle\" x=\"660.76\" y=\"-82.17\" font-family=\"Times,serif\" font-size=\"14.00\">properties:</text>\n",
       "<text text-anchor=\"middle\" x=\"660.76\" y=\"-65.67\" font-family=\"Times,serif\" font-size=\"14.00\">bloodPressure: Blood Pressure</text>\n",
       "<text text-anchor=\"middle\" x=\"660.76\" y=\"-49.17\" font-family=\"Times,serif\" font-size=\"14.00\">cholesterolLevel: Cholesterol Level</text>\n",
       "</g>\n",
       "<!-- Disease&#45;&gt;HealthIndicator -->\n",
       "<g id=\"edge3\" class=\"edge\">\n",
       "<title>Disease&#45;&gt;HealthIndicator</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M610.65,-238.85C621.45,-230.11 631.44,-219.95 638.76,-208.45 647.52,-194.67 653.01,-178.33 656.4,-162.19\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"659.8,-163.03 658.15,-152.57 652.91,-161.78 659.8,-163.03\"/>\n",
       "<text text-anchor=\"middle\" x=\"676.85\" y=\"-195.15\" font-family=\"Times,serif\" font-size=\"14.00\">HAS_LAB</text>\n",
       "</g>\n",
       "<!-- Outcome -->\n",
       "<g id=\"node5\" class=\"node\">\n",
       "<title>Outcome</title>\n",
       "<ellipse fill=\"none\" stroke=\"black\" cx=\"934.76\" cy=\"-86.97\" rx=\"107.3\" ry=\"51.97\"/>\n",
       "<text text-anchor=\"middle\" x=\"934.76\" y=\"-106.42\" font-family=\"Times,serif\" font-size=\"14.00\">Outcome</text>\n",
       "<text text-anchor=\"middle\" x=\"934.76\" y=\"-73.92\" font-family=\"Times,serif\" font-size=\"14.00\">properties:</text>\n",
       "<text text-anchor=\"middle\" x=\"934.76\" y=\"-57.42\" font-family=\"Times,serif\" font-size=\"14.00\">result: Outcome Variable</text>\n",
       "</g>\n",
       "<!-- Disease&#45;&gt;Outcome -->\n",
       "<g id=\"edge4\" class=\"edge\">\n",
       "<title>Disease&#45;&gt;Outcome</title>\n",
       "<path fill=\"none\" stroke=\"black\" d=\"M631.86,-250.88C687.43,-232.8 759.22,-206.3 818.76,-173.95 836.97,-164.05 855.52,-151.58 872.29,-139.23\"/>\n",
       "<polygon fill=\"black\" stroke=\"black\" points=\"874.3,-142.1 880.2,-133.3 870.1,-136.5 874.3,-142.1\"/>\n",
       "<text text-anchor=\"middle\" x=\"833.57\" y=\"-195.15\" font-family=\"Times,serif\" font-size=\"14.00\">HAS_OUTCOME</text>\n",
       "</g>\n",
       "</g>\n",
       "</svg>\n"
      ],
      "text/plain": [
       "<graphviz.graphs.Digraph at 0x12f10a1b0>"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#For making corrections in the code\n",
    "gdm.iterate_model(user_corrections=\"\"\"\n",
    "1. Remove the relationships between Patient and Disease, between Patient and HealthIndicator and between Patient and Outcome and Disease and Symptom.\n",
    "3. Create a relationship HAS_DEMOGRAPHICS from Disease to Demographics.\n",
    "4. Create a relationship HAS_SYMPTOM from Disease to Symptom. If the Symptom value is No, remove this relationship.\n",
    "5. Create a relationship HAS_LAB from Disease to HealthIndicator.\n",
    "6. Create a relationship HAS_OUTCOME from Disease to Outcome.\n",
    "\"\"\")\n",
    "gdm.current_model.visualize()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Use our data model to generate some ingestion code\n",
    "# instantiate ingestion generator\n",
    "gen = PyIngestConfigGenerator(data_model=gdm.current_model, \n",
    "                              username=\"neo4j\", \n",
    "                              password=\"StrongPassword123\", \n",
    "                              uri=\"bolt://localhost:7687\", \n",
    "                              database=\"neo4j\",\n",
    "                              csv_name=\"test_dis.csv\")\n",
    "\n",
    "# create ingestion YAML \n",
    "pyingest_yaml = gen.generate_config_string()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "File {} .//./test_dis.csv\n",
      "loading... 0 2024-09-03 22:10:38.701523\n",
      "loading... 1 2024-09-03 22:10:38.896435\n",
      "loading... 2 2024-09-03 22:10:38.934699\n",
      "{} : Completed file 2024-09-03 22:10:38.967849\n",
      "File {} .//./test_dis.csv\n",
      "loading... 0 2024-09-03 22:10:38.968528\n",
      "loading... 1 2024-09-03 22:10:39.072050\n",
      "loading... 2 2024-09-03 22:10:39.094302\n",
      "{} : Completed file 2024-09-03 22:10:39.111809\n",
      "File {} .//./test_dis.csv\n",
      "loading... 0 2024-09-03 22:10:39.113229\n",
      "loading... 1 2024-09-03 22:10:39.173196\n",
      "loading... 2 2024-09-03 22:10:39.194073\n",
      "{} : Completed file 2024-09-03 22:10:39.209721\n",
      "File {} .//./test_dis.csv\n",
      "loading... 0 2024-09-03 22:10:39.210681\n",
      "loading... 1 2024-09-03 22:10:39.259216\n",
      "loading... 2 2024-09-03 22:10:39.276353\n",
      "{} : Completed file 2024-09-03 22:10:39.291170\n",
      "File {} .//./test_dis.csv\n",
      "loading... 0 2024-09-03 22:10:39.291888\n",
      "loading... 1 2024-09-03 22:10:39.346028\n",
      "loading... 2 2024-09-03 22:10:39.361594\n",
      "{} : Completed file 2024-09-03 22:10:39.374629\n",
      "File {} .//./test_dis.csv\n",
      "loading... 0 2024-09-03 22:10:39.375366\n",
      "loading... 1 2024-09-03 22:10:39.525773\n",
      "loading... 2 2024-09-03 22:10:39.560536\n",
      "{} : Completed file 2024-09-03 22:10:39.597821\n",
      "File {} .//./test_dis.csv\n",
      "loading... 0 2024-09-03 22:10:39.598615\n",
      "loading... 1 2024-09-03 22:10:39.721086\n",
      "loading... 2 2024-09-03 22:10:39.740930\n",
      "{} : Completed file 2024-09-03 22:10:39.761116\n",
      "File {} .//./test_dis.csv\n",
      "loading... 0 2024-09-03 22:10:39.762097\n",
      "loading... 1 2024-09-03 22:10:39.834200\n",
      "loading... 2 2024-09-03 22:10:39.850630\n",
      "{} : Completed file 2024-09-03 22:10:39.867895\n",
      "File {} .//./test_dis.csv\n",
      "loading... 0 2024-09-03 22:10:39.869307\n",
      "loading... 1 2024-09-03 22:10:39.937184\n",
      "loading... 2 2024-09-03 22:10:39.955259\n",
      "{} : Completed file 2024-09-03 22:10:39.977837\n"
     ]
    }
   ],
   "source": [
    "#Use generated PyIngest yaml config to ingest our CSV into our Neo4j instance\n",
    "PyIngest(config=pyingest_yaml, dataframe=disease_df)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [],
   "source": [
    "#We can also save this as a .yaml file and use with the original PyIngest.\n",
    "gen.generate_config_yaml(file_name=\"diseases.yaml\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain_google_genai import ChatGoogleGenerativeAI\n",
    "GOOGLE_API_KEY = 'AIzaSyCOixNIQyZUAo7n2QYhF36iRPPXgpgnPEw'\n",
    "queschain_llm = ChatGoogleGenerativeAI(model = \"gemini-pro\", google_api_key = GOOGLE_API_KEY)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'Hello there! How can I assist you today?'"
      ]
     },
     "execution_count": 45,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "queschain_llm.invoke(\"Hi\").content"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [],
   "source": [
    "import warnings\n",
    "import json\n",
    "from langchain_community.graphs import Neo4jGraph\n",
    "\n",
    "with warnings.catch_warnings():\n",
    "    warnings.simplefilter('ignore')\n",
    "\n",
    "NEO4J_USERNAME = \"neo4j\"\n",
    "NEO4J_DATABASE = 'neo4j'\n",
    "NEO4J_URI = 'bolt://localhost:7687'\n",
    "NEO4J_PASSWORD = 'StrongPassword123'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {},
   "outputs": [],
   "source": [
    "kg = Neo4jGraph(\n",
    "    url=NEO4J_URI, username=NEO4J_USERNAME, password=NEO4J_PASSWORD, database=NEO4J_DATABASE\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "metadata": {},
   "outputs": [],
   "source": [
    "import textwrap"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Node properties: Disease {name: STRING} Symptom {fatigue:\n",
      "STRING, difficultyBreathing: STRING, cough: STRING, fever:\n",
      "STRING} Demographics {age: INTEGER, gender: STRING}\n",
      "HealthIndicator {bloodPressure: STRING, cholesterolLevel:\n",
      "STRING} Outcome {result: STRING} Relationship properties:\n",
      "The relationships: (:Disease)-[:HAS_OUTCOME]->(:Outcome)\n",
      "(:Disease)-[:HAS_DEMOGRAPHICS]->(:Demographics)\n",
      "(:Disease)-[:HAS_SYMPTOM]->(:Symptom)\n",
      "(:Disease)-[:HAS_LAB]->(:HealthIndicator)\n"
     ]
    }
   ],
   "source": [
    "kg.refresh_schema()\n",
    "print(textwrap.fill(kg.schema, 60))\n",
    "schema=kg.schema"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 52,
   "metadata": {},
   "outputs": [],
   "source": [
    "schema='''{\n",
    "  \"HAS_OUTCOME\": {\n",
    "    \"count\": 116,\n",
    "    \"properties\": {\n",
    "\n",
    "    },\n",
    "    \"type\": \"relationship\"\n",
    "  },\n",
    "  \"HAS_SYMPTOM\": {\n",
    "    \"count\": 116,\n",
    "    \"properties\": {\n",
    "\n",
    "    },\n",
    "    \"type\": \"relationship\"\n",
    "  },\n",
    "  \"HAS_LAB\": {\n",
    "    \"count\": 116,\n",
    "    \"properties\": {\n",
    "\n",
    "    },\n",
    "    \"type\": \"relationship\"\n",
    "  },\n",
    "  \"Disease\": {\n",
    "    \"count\": 116,\n",
    "    \"labels\": [],\n",
    "    \"properties\": {\n",
    "      \"name\": {\n",
    "        \"unique\": true,\n",
    "        \"indexed\": true,\n",
    "        \"type\": \"STRING\",\n",
    "        \"existence\": false\n",
    "      }\n",
    "    },\n",
    "    \"type\": \"node\",\n",
    "    \"relationships\": {\n",
    "      \"HAS_OUTCOME\": {\n",
    "        \"count\": 0,\n",
    "        \"direction\": \"out\",\n",
    "        \"labels\": [\n",
    "          \"Outcome\"\n",
    "        ],\n",
    "        \"properties\": {\n",
    "\n",
    "        }\n",
    "      },\n",
    "      \"HAS_SYMPTOM\": {\n",
    "        \"count\": 0,\n",
    "        \"direction\": \"out\",\n",
    "        \"labels\": [\n",
    "          \"Symptom\"\n",
    "        ],\n",
    "        \"properties\": {\n",
    "\n",
    "        }\n",
    "      },\n",
    "      \"HAS_LAB\": {\n",
    "        \"count\": 0,\n",
    "        \"direction\": \"out\",\n",
    "        \"labels\": [\n",
    "          \"HealthIndicator\"\n",
    "        ],\n",
    "        \"properties\": {\n",
    "\n",
    "        }\n",
    "      },\n",
    "      \"HAS_DEMOGRAPHICS\": {\n",
    "        \"count\": 0,\n",
    "        \"direction\": \"out\",\n",
    "        \"labels\": [\n",
    "          \"Demographics\"\n",
    "        ],\n",
    "        \"properties\": {\n",
    "\n",
    "        }\n",
    "      }\n",
    "    }\n",
    "  },\n",
    "  \"HAS_DEMOGRAPHICS\": {\n",
    "    \"count\": 116,\n",
    "    \"properties\": {\n",
    "\n",
    "    },\n",
    "    \"type\": \"relationship\"\n",
    "  },\n",
    "  \"HealthIndicator\": {\n",
    "    \"count\": 1,\n",
    "    \"labels\": [],\n",
    "    \"properties\": {\n",
    "      \"cholesterolLevel\": {\n",
    "        \"unique\": false,\n",
    "        \"indexed\": false,\n",
    "        \"type\": \"STRING\",\n",
    "        \"existence\": false\n",
    "      },\n",
    "      \"bloodPressure\": {\n",
    "        \"unique\": false,\n",
    "        \"indexed\": false,\n",
    "        \"type\": \"STRING\",\n",
    "        \"existence\": false\n",
    "      }\n",
    "    },\n",
    "    \"type\": \"node\",\n",
    "    \"relationships\": {\n",
    "      \"HAS_LAB\": {\n",
    "        \"count\": 116,\n",
    "        \"direction\": \"in\",\n",
    "        \"labels\": [\n",
    "          \"Disease\"\n",
    "        ],\n",
    "        \"properties\": {\n",
    "\n",
    "        }\n",
    "      }\n",
    "    }\n",
    "  },\n",
    "  \"Outcome\": {\n",
    "    \"count\": 1,\n",
    "    \"labels\": [],\n",
    "    \"properties\": {\n",
    "      \"result\": {\n",
    "        \"unique\": false,\n",
    "        \"indexed\": false,\n",
    "        \"type\": \"STRING\",\n",
    "        \"existence\": false\n",
    "      }\n",
    "    },\n",
    "    \"type\": \"node\",\n",
    "    \"relationships\": {\n",
    "      \"HAS_OUTCOME\": {\n",
    "        \"count\": 116,\n",
    "        \"direction\": \"in\",\n",
    "        \"labels\": [\n",
    "          \"Disease\"\n",
    "        ],\n",
    "        \"properties\": {\n",
    "\n",
    "        }\n",
    "      }\n",
    "    }\n",
    "  },\n",
    "  \"Demographics\": {\n",
    "    \"count\": 1,\n",
    "    \"labels\": [],\n",
    "    \"properties\": {\n",
    "      \"age\": {\n",
    "        \"unique\": false,\n",
    "        \"indexed\": false,\n",
    "        \"type\": \"INTEGER\",\n",
    "        \"existence\": false\n",
    "      },\n",
    "      \"gender\": {\n",
    "        \"unique\": false,\n",
    "        \"indexed\": false,\n",
    "        \"type\": \"STRING\",\n",
    "        \"existence\": false\n",
    "      }\n",
    "    },\n",
    "    \"type\": \"node\",\n",
    "    \"relationships\": {\n",
    "      \"HAS_DEMOGRAPHICS\": {\n",
    "        \"count\": 116,\n",
    "        \"direction\": \"in\",\n",
    "        \"labels\": [\n",
    "          \"Disease\"\n",
    "        ],\n",
    "        \"properties\": {\n",
    "\n",
    "        }\n",
    "      }\n",
    "    }\n",
    "  },\n",
    "  \"Symptom\": {\n",
    "    \"count\": 1,\n",
    "    \"labels\": [],\n",
    "    \"properties\": {\n",
    "      \"cough\": {\n",
    "        \"unique\": false,\n",
    "        \"indexed\": false,\n",
    "        \"type\": \"STRING\",\n",
    "        \"existence\": false\n",
    "      },\n",
    "      \"fever\": {\n",
    "        \"unique\": false,\n",
    "        \"indexed\": false,\n",
    "        \"type\": \"STRING\",\n",
    "        \"existence\": false\n",
    "      },\n",
    "      \"difficultyBreathing\": {\n",
    "        \"unique\": false,\n",
    "        \"indexed\": false,\n",
    "        \"type\": \"STRING\",\n",
    "        \"existence\": false\n",
    "      },\n",
    "      \"fatigue\": {\n",
    "        \"unique\": false,\n",
    "        \"indexed\": false,\n",
    "        \"type\": \"STRING\",\n",
    "        \"existence\": false\n",
    "      }\n",
    "    },\n",
    "    \"type\": \"node\",\n",
    "    \"relationships\": {\n",
    "      \"HAS_SYMPTOM\": {\n",
    "        \"count\": 116,\n",
    "        \"direction\": \"in\",\n",
    "        \"labels\": [\n",
    "          \"Disease\"\n",
    "        ],\n",
    "        \"properties\": {\n",
    "\n",
    "        }\n",
    "      }\n",
    "    }\n",
    "  }\n",
    "}'''"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 61,
   "metadata": {},
   "outputs": [],
   "source": [
    "question='''Patient Information:\n",
    "Jane Doe, a 58-year-old female, was admitted on June 15, 2024.\n",
    "\n",
    "Chief Complaint and History of Present Illness:\n",
    "Jane reported a high fever up to 104°F, body pain, and a rash, \n",
    "starting five days prior to admission.\n",
    "\n",
    "Past Medical History:\n",
    "Jane has no significant past medical history and no known allergies.\n",
    "\n",
    "Physical Examination:\n",
    "Jane's temperature was 102.8°F, heart rate 110 bpm, blood pressure 100/70 mmHg, and respiratory rate 20 breaths \n",
    "per minute. No petechiae or purpura were noted.\n",
    "\n",
    "What disease may she have?'''"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 53,
   "metadata": {},
   "outputs": [],
   "source": [
    "prompt_template = \"\"\"\n",
    "Let's think step by step:\n",
    "\n",
    "Step1: Task:\n",
    "Generate an effective and concise Cypher statement with less than 256 characteres to query a graph database\n",
    "Do not comment the code.\n",
    "\n",
    "Step 2: Get to know the database schema: {schema}\n",
    "\n",
    "Step 3: Instructions:\n",
    "- In the cypher query, ONLY USE the provided relationship types and properties that appear in the schema AND in the user question.\n",
    "- In the cypher query, do not use any other relationship types or properties in the user's question that are not contained in the provided schema.\n",
    "- Regarding Age, NEVER work with the age itself. For example: 24 years old, use interval: more than 20 years old.\n",
    "- USE ONLY ONE statement for Age, always use 'greater than', never 'less than' or 'equal'.\n",
    "- DO NOT USE property keys that are not in the database.\n",
    "\n",
    "Step 4: Examples: \n",
    "Here are a few examples of generated Cypher statements for particular questions:\n",
    "\n",
    "4.1 Which diseases present high blood pressure?\n",
    "MATCH (d:Disease)\n",
    "MATCH (d)-[r:HAS_LAB]->(l)\n",
    "WHERE l.bloodPressure = 'High'\n",
    "RETURN d.name\n",
    "\n",
    "4.2 Which diseases present indicators as high blood pressure?\n",
    "// Match the Disease nodes\n",
    "MATCH (d:Disease)\n",
    "// Match HAS_LAB relationships from Disease nodes to Lab nodes\n",
    "MATCH (d)-[r:HAS_LAB]->(l)\n",
    "MATCH (d)-[r2:HAS_OUTCOME]->(o)\n",
    "// Ensure the Lab nodes have the bloodPressure property set to 'High'\n",
    "WHERE l.bloodPressure = 'High' AND o.result='Positive'\n",
    "RETURN d, properties(d) AS disease_properties, r, properties(r) AS relationship_properties, l, properties(l) AS lab_properties\n",
    "\n",
    "4.3 What is the name of a disease of the elderly where the patient presents high blood pressure, high cholesterol, fever, fatigue\n",
    "MATCH (d:Disease)\n",
    "MATCH (d)-[r1:HAS_LAB]->(lab)\n",
    "MATCH (d)-[r2:HAS_SYMPTOM]->(symptom)\n",
    "MATCH (symptom)-[r3:HAS_DEMOGRAPHICS]->(demo)\n",
    "WHERE lab.bloodPressure = 'High' AND lab.cholesterolLevel = 'High' AND symptom.fever = 'Yes' AND symptom.fatigue = 'Yes' AND TOINTEGER(demo.age) >40\n",
    "RETURN d.name\n",
    "\n",
    "4.4 What disease gives you fever, fatigue, no cough, no short breathe in people with high cholesterol?\n",
    "MATCH (d:Disease)-[r:HAS_SYMPTOM]->(s:Symptom)\n",
    "WHERE s.fever = 'Yes' AND s.fatigue = 'Yes' AND s.difficultyBreathing = 'No' AND s.cough = 'No'\n",
    "MATCH (d:Disease)-[r1:HAS_LAB]->(lab:HealthIndicator)\n",
    "MATCH (d)-[r2:HAS_OUTCOME]->(o:Outcome)\n",
    "WHERE lab.cholesterolLevel='High' AND o.result='Positive'\n",
    "RETURN d, properties(d) AS disease_properties, r, properties(r) AS relationship_properties\n",
    "\n",
    "\n",
    "Step 5. These are the values allowed for each entity:\n",
    "- Fever: Indicates whether the patient has a fever (Yes/No).\n",
    "- Cough: Indicates whether the patient has a cough (Yes/No).\n",
    "- Fatigue: Indicates whether the patient experiences fatigue (Yes/No).\n",
    "- Difficulty Breathing': 'Indicates whether the patient has difficulty breathing (Yes/No).\n",
    "- Age: The age of the patient in years.\n",
    "- Gender: The gender of the patient (Male/Female).\n",
    "- Blood Pressure: The blood pressure level of the patient (Normal/High).\n",
    "- Cholesterol Level: The cholesterol level of the patient (Normal/High).\n",
    "- Outcome Variable: The outcome variable indicating the result of the diagnosis or assessment for the specific disease (Positive/Negative).\n",
    "\n",
    "Step 6. Answer the question {question}.\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 72,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/var/folders/5v/t2dbc1k52p18ngftr23kjfbm0000gn/T/ipykernel_64142/1791762908.py:4: LangChainDeprecationWarning: The class `ChatOpenAI` was deprecated in LangChain 0.0.10 and will be removed in 1.0. An updated version of the class exists in the langchain-openai package and should be used instead. To use it run `pip install -U langchain-openai` and import as `from langchain_openai import ChatOpenAI`.\n",
      "  chat_llm = ChatOpenAI(\n"
     ]
    }
   ],
   "source": [
    "from langchain.chat_models import ChatOpenAI\n",
    "\n",
    "# Instantiate the ChatOpenAI object with your OpenAI API key\n",
    "chat_llm = ChatOpenAI(\n",
    "    openai_api_key=\"sk-5tLuQzXGUemKeK54H-jdat1WZs7uFRvYDvWU83p-NZT3BlbkFJ2KPYOXc2YWLMW8bnv30KaxUYJQaAZx8jkPJ-tOMeoA\",\n",
    "    model=\"gpt-3.5-turbo\",  # or use \"gpt-4\" if you have access\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 62,
   "metadata": {},
   "outputs": [],
   "source": [
    "cypher_prompt = PromptTemplate(\n",
    "    input_variables=[\"schema\",\"question\"], \n",
    "    template=prompt_template\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 73,
   "metadata": {},
   "outputs": [],
   "source": [
    "cypherChain = GraphCypherQAChain.from_llm(\n",
    "    chat_llm,\n",
    "    graph=kg,\n",
    "    verbose=True,\n",
    "    cypher_prompt=cypher_prompt,\n",
    "    top_k=10 # this can be adjusted also\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 76,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (d:Disease {name: \"Liver Cancer\"})-[:HAS_SYMPTOM]->(s:Symptom)\n",
      "RETURN s.fever, s.cough, s.fatigue, s.difficultyBreathing\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'s.fever': 'Yes', 's.cough': 'No', 's.fatigue': 'Yes', 's.difficultyBreathing': 'No'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'Fever and fatigue are symptoms of liver cancer.'"
      ]
     },
     "execution_count": 76,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypherChain.run(\"\"\"\n",
    "what are the symptoms of liver cancer\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 70,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n"
     ]
    },
    {
     "ename": "ValueError",
     "evalue": "Missing some input keys: {'query'}",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mValueError\u001b[0m                                Traceback (most recent call last)",
      "Cell \u001b[0;32mIn[70], line 1\u001b[0m\n\u001b[0;32m----> 1\u001b[0m response \u001b[38;5;241m=\u001b[39m \u001b[43mcypherChain\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mrun\u001b[49m\u001b[43m(\u001b[49m\u001b[43m{\u001b[49m\u001b[43mschema\u001b[49m\u001b[43m:\u001b[49m\u001b[43mschema\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mquestion\u001b[49m\u001b[43m:\u001b[49m\u001b[43mquestion\u001b[49m\u001b[43m}\u001b[49m\u001b[43m)\u001b[49m\n\u001b[1;32m      2\u001b[0m \u001b[38;5;28mprint\u001b[39m(response)\n",
      "File \u001b[0;32m~/Documents/Project/Knowledge_bot/genAi/lib/python3.12/site-packages/langchain_core/_api/deprecation.py:180\u001b[0m, in \u001b[0;36mdeprecated.<locals>.deprecate.<locals>.warning_emitting_wrapper\u001b[0;34m(*args, **kwargs)\u001b[0m\n\u001b[1;32m    178\u001b[0m     warned \u001b[38;5;241m=\u001b[39m \u001b[38;5;28;01mTrue\u001b[39;00m\n\u001b[1;32m    179\u001b[0m     emit_warning()\n\u001b[0;32m--> 180\u001b[0m \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[43mwrapped\u001b[49m\u001b[43m(\u001b[49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[43margs\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[43mkwargs\u001b[49m\u001b[43m)\u001b[49m\n",
      "File \u001b[0;32m~/Documents/Project/Knowledge_bot/genAi/lib/python3.12/site-packages/langchain/chains/base.py:598\u001b[0m, in \u001b[0;36mChain.run\u001b[0;34m(self, callbacks, tags, metadata, *args, **kwargs)\u001b[0m\n\u001b[1;32m    596\u001b[0m     \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28mlen\u001b[39m(args) \u001b[38;5;241m!=\u001b[39m \u001b[38;5;241m1\u001b[39m:\n\u001b[1;32m    597\u001b[0m         \u001b[38;5;28;01mraise\u001b[39;00m \u001b[38;5;167;01mValueError\u001b[39;00m(\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124m`run` supports only one positional argument.\u001b[39m\u001b[38;5;124m\"\u001b[39m)\n\u001b[0;32m--> 598\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28;43mself\u001b[39;49m\u001b[43m(\u001b[49m\u001b[43margs\u001b[49m\u001b[43m[\u001b[49m\u001b[38;5;241;43m0\u001b[39;49m\u001b[43m]\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mcallbacks\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mcallbacks\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mtags\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mtags\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mmetadata\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mmetadata\u001b[49m\u001b[43m)\u001b[49m[\n\u001b[1;32m    599\u001b[0m         _output_key\n\u001b[1;32m    600\u001b[0m     ]\n\u001b[1;32m    602\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m kwargs \u001b[38;5;129;01mand\u001b[39;00m \u001b[38;5;129;01mnot\u001b[39;00m args:\n\u001b[1;32m    603\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28mself\u001b[39m(kwargs, callbacks\u001b[38;5;241m=\u001b[39mcallbacks, tags\u001b[38;5;241m=\u001b[39mtags, metadata\u001b[38;5;241m=\u001b[39mmetadata)[\n\u001b[1;32m    604\u001b[0m         _output_key\n\u001b[1;32m    605\u001b[0m     ]\n",
      "File \u001b[0;32m~/Documents/Project/Knowledge_bot/genAi/lib/python3.12/site-packages/langchain_core/_api/deprecation.py:180\u001b[0m, in \u001b[0;36mdeprecated.<locals>.deprecate.<locals>.warning_emitting_wrapper\u001b[0;34m(*args, **kwargs)\u001b[0m\n\u001b[1;32m    178\u001b[0m     warned \u001b[38;5;241m=\u001b[39m \u001b[38;5;28;01mTrue\u001b[39;00m\n\u001b[1;32m    179\u001b[0m     emit_warning()\n\u001b[0;32m--> 180\u001b[0m \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[43mwrapped\u001b[49m\u001b[43m(\u001b[49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[43margs\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[43mkwargs\u001b[49m\u001b[43m)\u001b[49m\n",
      "File \u001b[0;32m~/Documents/Project/Knowledge_bot/genAi/lib/python3.12/site-packages/langchain/chains/base.py:381\u001b[0m, in \u001b[0;36mChain.__call__\u001b[0;34m(self, inputs, return_only_outputs, callbacks, tags, metadata, run_name, include_run_info)\u001b[0m\n\u001b[1;32m    349\u001b[0m \u001b[38;5;250m\u001b[39m\u001b[38;5;124;03m\"\"\"Execute the chain.\u001b[39;00m\n\u001b[1;32m    350\u001b[0m \n\u001b[1;32m    351\u001b[0m \u001b[38;5;124;03mArgs:\u001b[39;00m\n\u001b[0;32m   (...)\u001b[0m\n\u001b[1;32m    372\u001b[0m \u001b[38;5;124;03m        `Chain.output_keys`.\u001b[39;00m\n\u001b[1;32m    373\u001b[0m \u001b[38;5;124;03m\"\"\"\u001b[39;00m\n\u001b[1;32m    374\u001b[0m config \u001b[38;5;241m=\u001b[39m {\n\u001b[1;32m    375\u001b[0m     \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mcallbacks\u001b[39m\u001b[38;5;124m\"\u001b[39m: callbacks,\n\u001b[1;32m    376\u001b[0m     \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mtags\u001b[39m\u001b[38;5;124m\"\u001b[39m: tags,\n\u001b[1;32m    377\u001b[0m     \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mmetadata\u001b[39m\u001b[38;5;124m\"\u001b[39m: metadata,\n\u001b[1;32m    378\u001b[0m     \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mrun_name\u001b[39m\u001b[38;5;124m\"\u001b[39m: run_name,\n\u001b[1;32m    379\u001b[0m }\n\u001b[0;32m--> 381\u001b[0m \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43minvoke\u001b[49m\u001b[43m(\u001b[49m\n\u001b[1;32m    382\u001b[0m \u001b[43m    \u001b[49m\u001b[43minputs\u001b[49m\u001b[43m,\u001b[49m\n\u001b[1;32m    383\u001b[0m \u001b[43m    \u001b[49m\u001b[43mcast\u001b[49m\u001b[43m(\u001b[49m\u001b[43mRunnableConfig\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43m{\u001b[49m\u001b[43mk\u001b[49m\u001b[43m:\u001b[49m\u001b[43m \u001b[49m\u001b[43mv\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;28;43;01mfor\u001b[39;49;00m\u001b[43m \u001b[49m\u001b[43mk\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mv\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;129;43;01min\u001b[39;49;00m\u001b[43m \u001b[49m\u001b[43mconfig\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mitems\u001b[49m\u001b[43m(\u001b[49m\u001b[43m)\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;28;43;01mif\u001b[39;49;00m\u001b[43m \u001b[49m\u001b[43mv\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;129;43;01mis\u001b[39;49;00m\u001b[43m \u001b[49m\u001b[38;5;129;43;01mnot\u001b[39;49;00m\u001b[43m \u001b[49m\u001b[38;5;28;43;01mNone\u001b[39;49;00m\u001b[43m}\u001b[49m\u001b[43m)\u001b[49m\u001b[43m,\u001b[49m\n\u001b[1;32m    384\u001b[0m \u001b[43m    \u001b[49m\u001b[43mreturn_only_outputs\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mreturn_only_outputs\u001b[49m\u001b[43m,\u001b[49m\n\u001b[1;32m    385\u001b[0m \u001b[43m    \u001b[49m\u001b[43minclude_run_info\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43minclude_run_info\u001b[49m\u001b[43m,\u001b[49m\n\u001b[1;32m    386\u001b[0m \u001b[43m\u001b[49m\u001b[43m)\u001b[49m\n",
      "File \u001b[0;32m~/Documents/Project/Knowledge_bot/genAi/lib/python3.12/site-packages/langchain/chains/base.py:164\u001b[0m, in \u001b[0;36mChain.invoke\u001b[0;34m(self, input, config, **kwargs)\u001b[0m\n\u001b[1;32m    162\u001b[0m \u001b[38;5;28;01mexcept\u001b[39;00m \u001b[38;5;167;01mBaseException\u001b[39;00m \u001b[38;5;28;01mas\u001b[39;00m e:\n\u001b[1;32m    163\u001b[0m     run_manager\u001b[38;5;241m.\u001b[39mon_chain_error(e)\n\u001b[0;32m--> 164\u001b[0m     \u001b[38;5;28;01mraise\u001b[39;00m e\n\u001b[1;32m    165\u001b[0m run_manager\u001b[38;5;241m.\u001b[39mon_chain_end(outputs)\n\u001b[1;32m    167\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m include_run_info:\n",
      "File \u001b[0;32m~/Documents/Project/Knowledge_bot/genAi/lib/python3.12/site-packages/langchain/chains/base.py:152\u001b[0m, in \u001b[0;36mChain.invoke\u001b[0;34m(self, input, config, **kwargs)\u001b[0m\n\u001b[1;32m    145\u001b[0m run_manager \u001b[38;5;241m=\u001b[39m callback_manager\u001b[38;5;241m.\u001b[39mon_chain_start(\n\u001b[1;32m    146\u001b[0m     dumpd(\u001b[38;5;28mself\u001b[39m),\n\u001b[1;32m    147\u001b[0m     inputs,\n\u001b[1;32m    148\u001b[0m     run_id,\n\u001b[1;32m    149\u001b[0m     name\u001b[38;5;241m=\u001b[39mrun_name,\n\u001b[1;32m    150\u001b[0m )\n\u001b[1;32m    151\u001b[0m \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[0;32m--> 152\u001b[0m     \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_validate_inputs\u001b[49m\u001b[43m(\u001b[49m\u001b[43minputs\u001b[49m\u001b[43m)\u001b[49m\n\u001b[1;32m    153\u001b[0m     outputs \u001b[38;5;241m=\u001b[39m (\n\u001b[1;32m    154\u001b[0m         \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_call(inputs, run_manager\u001b[38;5;241m=\u001b[39mrun_manager)\n\u001b[1;32m    155\u001b[0m         \u001b[38;5;28;01mif\u001b[39;00m new_arg_supported\n\u001b[1;32m    156\u001b[0m         \u001b[38;5;28;01melse\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_call(inputs)\n\u001b[1;32m    157\u001b[0m     )\n\u001b[1;32m    159\u001b[0m     final_outputs: Dict[\u001b[38;5;28mstr\u001b[39m, Any] \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mprep_outputs(\n\u001b[1;32m    160\u001b[0m         inputs, outputs, return_only_outputs\n\u001b[1;32m    161\u001b[0m     )\n",
      "File \u001b[0;32m~/Documents/Project/Knowledge_bot/genAi/lib/python3.12/site-packages/langchain/chains/base.py:282\u001b[0m, in \u001b[0;36mChain._validate_inputs\u001b[0;34m(self, inputs)\u001b[0m\n\u001b[1;32m    280\u001b[0m missing_keys \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mset\u001b[39m(\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39minput_keys)\u001b[38;5;241m.\u001b[39mdifference(inputs)\n\u001b[1;32m    281\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m missing_keys:\n\u001b[0;32m--> 282\u001b[0m     \u001b[38;5;28;01mraise\u001b[39;00m \u001b[38;5;167;01mValueError\u001b[39;00m(\u001b[38;5;124mf\u001b[39m\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mMissing some input keys: \u001b[39m\u001b[38;5;132;01m{\u001b[39;00mmissing_keys\u001b[38;5;132;01m}\u001b[39;00m\u001b[38;5;124m\"\u001b[39m)\n",
      "\u001b[0;31mValueError\u001b[0m: Missing some input keys: {'query'}"
     ]
    }
   ],
   "source": [
    "response = cypherChain.run(query={schema:schema, question:question})\n",
    "print(response)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 49,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (d: Disease) RETURN count(d)\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'count(d)': 116}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'There are 116 diseases in the database.'"
      ]
     },
     "execution_count": 49,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypherChain.run(\"\"\"How many diseases are present in the database?\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 50,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: description)} {position: line: 2, column: 35, offset: 52} for query: 'MATCH (d:Disease)\\nWITH d, d.name AS disease_name, d.description AS disease_description\\nMATCH (d)-[r:HAS_OUTCOME]->(o:Outcome)\\nWITH d, disease_name, disease_description, o.result AS outcome_result\\nMATCH (d)-[r1:HAS_DEMOGRAPHICS]->(demo:Demographics)\\nWITH d, disease_name, disease_description, outcome_result, demo.age AS age, demo.gender AS gender\\nMATCH (d)-[r2:HAS_SYMPTOM]->(s:Symptom)\\nWITH d, disease_name, disease_description, outcome_result, age, gender, s.fatigue AS fatigue, s.difficultyBreathing AS difficulty_breathing, s.cough AS cough, s.fever AS fever\\nMATCH (d)-[r3:HAS_LAB]->(l:HealthIndicator)\\nWITH d, disease_name, disease_description, outcome_result, age, gender, fatigue, difficulty_breathing, cough, fever, l.bloodPressure AS blood_pressure, l.cholesterolLevel AS cholesterol_level\\nRETURN disease_name, disease_description, outcome_result, age, gender, fatigue, difficulty_breathing, cough, fever, blood_pressure, cholesterol_level'\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (d:Disease)\n",
      "WITH d, d.name AS disease_name, d.description AS disease_description\n",
      "MATCH (d)-[r:HAS_OUTCOME]->(o:Outcome)\n",
      "WITH d, disease_name, disease_description, o.result AS outcome_result\n",
      "MATCH (d)-[r1:HAS_DEMOGRAPHICS]->(demo:Demographics)\n",
      "WITH d, disease_name, disease_description, outcome_result, demo.age AS age, demo.gender AS gender\n",
      "MATCH (d)-[r2:HAS_SYMPTOM]->(s:Symptom)\n",
      "WITH d, disease_name, disease_description, outcome_result, age, gender, s.fatigue AS fatigue, s.difficultyBreathing AS difficulty_breathing, s.cough AS cough, s.fever AS fever\n",
      "MATCH (d)-[r3:HAS_LAB]->(l:HealthIndicator)\n",
      "WITH d, disease_name, disease_description, outcome_result, age, gender, fatigue, difficulty_breathing, cough, fever, l.bloodPressure AS blood_pressure, l.cholesterolLevel AS cholesterol_level\n",
      "RETURN disease_name, disease_description, outcome_result, age, gender, fatigue, difficulty_breathing, cough, fever, blood_pressure, cholesterol_level\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'disease_name': 'Influenza', 'disease_description': None, 'outcome_result': 'Positive', 'age': 90, 'gender': 'Female', 'fatigue': 'Yes', 'difficulty_breathing': 'No', 'cough': 'No', 'fever': 'Yes', 'blood_pressure': 'High', 'cholesterol_level': 'High'}, {'disease_name': 'Common Cold', 'disease_description': None, 'outcome_result': 'Positive', 'age': 90, 'gender': 'Female', 'fatigue': 'Yes', 'difficulty_breathing': 'No', 'cough': 'No', 'fever': 'Yes', 'blood_pressure': 'High', 'cholesterol_level': 'High'}, {'disease_name': 'Eczema', 'disease_description': None, 'outcome_result': 'Positive', 'age': 90, 'gender': 'Female', 'fatigue': 'Yes', 'difficulty_breathing': 'No', 'cough': 'No', 'fever': 'Yes', 'blood_pressure': 'High', 'cholesterol_level': 'High'}, {'disease_name': 'Asthma', 'disease_description': None, 'outcome_result': 'Positive', 'age': 90, 'gender': 'Female', 'fatigue': 'Yes', 'difficulty_breathing': 'No', 'cough': 'No', 'fever': 'Yes', 'blood_pressure': 'High', 'cholesterol_level': 'High'}, {'disease_name': 'Hyperthyroidism', 'disease_description': None, 'outcome_result': 'Positive', 'age': 90, 'gender': 'Female', 'fatigue': 'Yes', 'difficulty_breathing': 'No', 'cough': 'No', 'fever': 'Yes', 'blood_pressure': 'High', 'cholesterol_level': 'High'}, {'disease_name': 'Allergic Rhinitis', 'disease_description': None, 'outcome_result': 'Positive', 'age': 90, 'gender': 'Female', 'fatigue': 'Yes', 'difficulty_breathing': 'No', 'cough': 'No', 'fever': 'Yes', 'blood_pressure': 'High', 'cholesterol_level': 'High'}, {'disease_name': 'Anxiety Disorders', 'disease_description': None, 'outcome_result': 'Positive', 'age': 90, 'gender': 'Female', 'fatigue': 'Yes', 'difficulty_breathing': 'No', 'cough': 'No', 'fever': 'Yes', 'blood_pressure': 'High', 'cholesterol_level': 'High'}, {'disease_name': 'Diabetes', 'disease_description': None, 'outcome_result': 'Positive', 'age': 90, 'gender': 'Female', 'fatigue': 'Yes', 'difficulty_breathing': 'No', 'cough': 'No', 'fever': 'Yes', 'blood_pressure': 'High', 'cholesterol_level': 'High'}, {'disease_name': 'Gastroenteritis', 'disease_description': None, 'outcome_result': 'Positive', 'age': 90, 'gender': 'Female', 'fatigue': 'Yes', 'difficulty_breathing': 'No', 'cough': 'No', 'fever': 'Yes', 'blood_pressure': 'High', 'cholesterol_level': 'High'}, {'disease_name': 'Pancreatitis', 'disease_description': None, 'outcome_result': 'Positive', 'age': 90, 'gender': 'Female', 'fatigue': 'Yes', 'difficulty_breathing': 'No', 'cough': 'No', 'fever': 'Yes', 'blood_pressure': 'High', 'cholesterol_level': 'High'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'The database consists of several medical records. Each record contains the following information: disease name, disease description, outcome result, age, gender, fatigue, difficulty breathing, cough, fever, blood pressure, and cholesterol level.'"
      ]
     },
     "execution_count": 50,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypherChain.run(\"\"\"Describe the database\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
